frostfire45/Codewarrior/Lib/hc12c/include/mc9s12vr48.h
extern volatile PPSTSTR _PPST @(REG_BASE + 0x00000245UL);
#define PPST                            _PPST.Byte
#define PPST_PPST0                      _PPST.Bits.PPST0
#define PPST_PPST1                      _PPST.Bits.PPST1
#define PPST_PPST2                      _PPST.Bits.PPST2
#define PPST_PPST3                      _PPST.Bits.PPST3
#define PPST_PPST                       _PPST.MergedBits.grpPPST

#define PPST_PPST0_MASK                 1U
#define PPST_PPST1_MASK                 2U
#define PPST_PPST2_MASK                 4U
#define PPST_PPST3_MASK                 8U
#define PPST_PPST_MASK                  15U
#define PPST_PPST_BITNUM                0U


/*** MODRR - Port T Routing Register; 0x00000246 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** MODRR0 - Port T Routing Register Low; 0x00000246 ***/
    union {
      byte Byte;
      struct {
        byte MODRR00     :1;                                       /* Port T  routing */
        byte MODRR01     :1;                                       /* Port T  routing */
        byte MODRR02     :1;                                       /* Port T  routing */
        byte MODRR03     :1;                                       /* Port T  routing */
        byte MODRR04     :1;                                       /* Port T  routing */
        byte MODRR05     :1;                                       /* Port T  routing */
        byte MODRR06     :1;                                       /* Port T  routing */
        byte MODRR07     :1;                                       /* Port T  routing */
      } Bits;
    } MODRR0STR;
    #define MODRR0                      _MODRR.Overlap_STR.MODRR0STR.Byte
    #define MODRR0_MODRR00              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR00
    #define MODRR0_MODRR01              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR01
    #define MODRR0_MODRR02              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR02
    #define MODRR0_MODRR03              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR03
    #define MODRR0_MODRR04              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR04
    #define MODRR0_MODRR05              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR05
    #define MODRR0_MODRR06              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR06
    #define MODRR0_MODRR07              _MODRR.Overlap_STR.MODRR0STR.Bits.MODRR07
    /* MODRR_ARR: Access 2 MODRRx registers in an array */
    #define MODRR_ARR                   ((volatile byte *) &MODRR0)
    
    #define MODRR0_MODRR00_MASK         1U
    #define MODRR0_MODRR01_MASK         2U
    #define MODRR0_MODRR02_MASK         4U
    #define MODRR0_MODRR03_MASK         8U
    #define MODRR0_MODRR04_MASK         16U
    #define MODRR0_MODRR05_MASK         32U
    #define MODRR0_MODRR06_MASK         64U
    #define MODRR0_MODRR07_MASK         128U
    

    /*** MODRR1 - Port T Routing Register High; 0x00000247 ***/
    union {
      byte Byte;
      struct {
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte MODRR14     :1;                                       /* Port T  routing */
        byte MODRR15     :1;                                       /* Port T  routing */
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
        byte grpMODRR_14 :2;
        byte     :1;
        byte     :1;
      } MergedBits;
    } MODRR1STR;
    #define MODRR1                      _MODRR.Overlap_STR.MODRR1STR.Byte
    #define MODRR1_MODRR14              _MODRR.Overlap_STR.MODRR1STR.Bits.MODRR14
    #define MODRR1_MODRR15              _MODRR.Overlap_STR.MODRR1STR.Bits.MODRR15
    #define MODRR1_MODRR_14             _MODRR.Overlap_STR.MODRR1STR.MergedBits.grpMODRR_14
    #define MODRR1_MODRR                MODRR1_MODRR_14
    
    #define MODRR1_MODRR14_MASK         16U
    #define MODRR1_MODRR15_MASK         32U
    #define MODRR1_MODRR_14_MASK        48U
    #define MODRR1_MODRR_14_BITNUM      4U
    
  } Overlap_STR;

  struct {
    word MODRR00     :1;                                       /* Port T  routing */
    word MODRR01     :1;                                       /* Port T  routing */
    word MODRR02     :1;                                       /* Port T  routing */
    word MODRR03     :1;                                       /* Port T  routing */
    word MODRR04     :1;                                       /* Port T  routing */
    word MODRR05     :1;                                       /* Port T  routing */
    word MODRR06     :1;                                       /* Port T  routing */
    word MODRR07     :1;                                       /* Port T  routing */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word MODRR14     :1;                                       /* Port T  routing */
    word MODRR15     :1;                                       /* Port T  routing */
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpMODRR0 :8;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpMODRR_14 :2;
    word         :1;
    word         :1;
  } MergedBits;
} MODRRSTR;
extern volatile MODRRSTR _MODRR @(REG_BASE + 0x00000246UL);
#define MODRR                           _MODRR.Word
#define MODRR_MODRR00                   _MODRR.Bits.MODRR00
#define MODRR_MODRR01                   _MODRR.Bits.MODRR01
#define MODRR_MODRR02                   _MODRR.Bits.MODRR02
#define MODRR_MODRR03                   _MODRR.Bits.MODRR03
#define MODRR_MODRR04                   _MODRR.Bits.MODRR04
#define MODRR_MODRR05                   _MODRR.Bits.MODRR05
#define MODRR_MODRR06                   _MODRR.Bits.MODRR06
#define MODRR_MODRR07                   _MODRR.Bits.MODRR07
#define MODRR_MODRR14                   _MODRR.Bits.MODRR14
#define MODRR_MODRR15                   _MODRR.Bits.MODRR15
#define MODRR_MODRR0                    _MODRR.MergedBits.grpMODRR0
#define MODRR_MODRR_14                  _MODRR.MergedBits.grpMODRR_14

#define MODRR_MODRR00_MASK              1U
#define MODRR_MODRR01_MASK              2U
#define MODRR_MODRR02_MASK              4U
#define MODRR_MODRR03_MASK              8U
#define MODRR_MODRR04_MASK              16U
#define MODRR_MODRR05_MASK              32U
#define MODRR_MODRR06_MASK              64U
#define MODRR_MODRR07_MASK              128U
#define MODRR_MODRR14_MASK              4096U
#define MODRR_MODRR15_MASK              8192U
#define MODRR_MODRR0_MASK               255U
#define MODRR_MODRR0_BITNUM             0U
#define MODRR_MODRR_14_MASK             12288U
#define MODRR_MODRR_14_BITNUM           12U


/*** PTS - Port S Data Register; 0x00000248 ***/
typedef union {
  byte Byte;
  struct {
    byte PTS0        :1;                                       /* Port S general purpose input/output data bit 0 */
    byte PTS1        :1;                                       /* Port S general purpose input/output data bit 1 */
    byte PTS2        :1;                                       /* Port S general purpose input/output data bit 2 */
    byte PTS3        :1;                                       /* Port S general purpose input/output data bit 3 */
    byte PTS4        :1;                                       /* Port S general purpose input/output data bit 4 */
    byte PTS5        :1;                                       /* Port S general purpose input/output data bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTS  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTSSTR;
extern volatile PTSSTR _PTS @(REG_BASE + 0x00000248UL);
#define PTS                             _PTS.Byte
#define PTS_PTS0                        _PTS.Bits.PTS0
#define PTS_PTS1                        _PTS.Bits.PTS1
#define PTS_PTS2                        _PTS.Bits.PTS2
#define PTS_PTS3                        _PTS.Bits.PTS3
#define PTS_PTS4                        _PTS.Bits.PTS4
#define PTS_PTS5                        _PTS.Bits.PTS5
#define PTS_PTS                         _PTS.MergedBits.grpPTS

#define PTS_PTS0_MASK                   1U
#define PTS_PTS1_MASK                   2U
#define PTS_PTS2_MASK                   4U
#define PTS_PTS3_MASK                   8U
#define PTS_PTS4_MASK                   16U
#define PTS_PTS5_MASK                   32U
#define PTS_PTS_MASK                    63U
#define PTS_PTS_BITNUM                  0U


/*** PTIS - Port S Input Register; 0x00000249 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIS0       :1;                                       /* Port S input data bit 0 */
    byte PTIS1       :1;                                       /* Port S input data bit 1 */
    byte PTIS2       :1;                                       /* Port S input data bit 2 */
    byte PTIS3       :1;                                       /* Port S input data bit 3 */
    byte PTIS4       :1;                                       /* Port S input data bit 4 */
    byte PTIS5       :1;                                       /* Port S input data bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIS :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTISSTR;
extern volatile PTISSTR _PTIS @(REG_BASE + 0x00000249UL);
#define PTIS                            _PTIS.Byte
#define PTIS_PTIS0                      _PTIS.Bits.PTIS0
#define PTIS_PTIS1                      _PTIS.Bits.PTIS1
#define PTIS_PTIS2                      _PTIS.Bits.PTIS2
#define PTIS_PTIS3                      _PTIS.Bits.PTIS3
#define PTIS_PTIS4                      _PTIS.Bits.PTIS4
#define PTIS_PTIS5                      _PTIS.Bits.PTIS5
#define PTIS_PTIS                       _PTIS.MergedBits.grpPTIS

#define PTIS_PTIS0_MASK                 1U
#define PTIS_PTIS1_MASK                 2U
#define PTIS_PTIS2_MASK                 4U
#define PTIS_PTIS3_MASK                 8U
#define PTIS_PTIS4_MASK                 16U
#define PTIS_PTIS5_MASK                 32U
#define PTIS_PTIS_MASK                  63U
#define PTIS_PTIS_BITNUM                0U


